<?php
/**
 * Created by PhpStorm.
 * User: langlive
 * Date: 16/12/7
 * Time: 下午5:54
 */
//php获取中文字符拼音首字母
function getFirstCharter($str)
{
    if (empty($str)) {
        return '';
    }
    $fchar = ord($str{0});
    if ($fchar >= ord('A') && $fchar <= ord('z')) return strtoupper($str{0});


    $s1 = iconv('UTF-8', 'gb2312//ignore', $str);
    $s2 = iconv('gb2312', 'UTF-8', $s1);
    $s = $s2 == $str ? $s1 : $str;
    $asc = ord($s{0}) * 256 + ord($s{1}) - 65536;
    if ($asc >= -20319 && $asc <= -20284) return 'A';
    if ($asc >= -20283 && $asc <= -19776) return 'B';
    if ($asc >= -19775 && $asc <= -19219) return 'C';
    if ($asc >= -19218 && $asc <= -18711) return 'D';
    if ($asc >= -18710 && $asc <= -18527) return 'E';
    if ($asc >= -18526 && $asc <= -18240) return 'F';
    if ($asc >= -18239 && $asc <= -17923) return 'G';
    if ($asc >= -17922 && $asc <= -17418) return 'H';
    if ($asc >= -17417 && $asc <= -16475) return 'J';
    if ($asc >= -16474 && $asc <= -16213) return 'K';
    if ($asc >= -16212 && $asc <= -15641) return 'L';
    if ($asc >= -15640 && $asc <= -15166) return 'M';
    if ($asc >= -15165 && $asc <= -14923) return 'N';
    if ($asc >= -14922 && $asc <= -14915) return 'O';
    if ($asc >= -14914 && $asc <= -14631) return 'P';
    if ($asc >= -14630 && $asc <= -14150) return 'Q';
    if ($asc >= -14149 && $asc <= -14091) return 'R';
    if ($asc >= -14090 && $asc <= -13319) return 'S';
    if ($asc >= -13318 && $asc <= -12839) return 'T';
    if ($asc >= -12838 && $asc <= -12557) return 'W';
    if ($asc >= -12556 && $asc <= -11848) return 'X';
    if ($asc >= -11847 && $asc <= -11056) return 'Y';
    if ($asc >= -11055 && $asc <= -10247) return 'Z';
    return null;
}

$arr = ["三信銀行","上海銀行","中國信託","中央信託","中華郵政","中華銀行","中華開發","九如鄉農會","二崙農會","二林農會","交通銀行","京城商銀","仁武農會","佳里鎮農會","兆豐商銀","六甲農會","六腳農會","北門農會","匯豐銀行","南州農會","南市區漁會","南縣漁會","口湖農會","古坑農會","台中二信","台中商銀","台中市農會","台北一信","台北九信","台北五信","台北商銀","台北富邦","台南三信","台新銀行","台東企銀","台東農會","台灣銀行","台西農會","合庫商銀","吉安農會","名間農會","員林農會","善化鎮農會","嘉義三信","嘉義四信","嘉義漁會","嘉義農會","四湖農會","國泰世華","土地銀行","埔心農會","埤頭鄉農會","基隆一信","基隆二信","壽豐農會","大埔農會","大埤農會","大寮農會","大林農會","大眾銀行","大社農會","太保農會","太麻里農會","安泰銀行","宜蘭信合社","富里鄉農會","寶華銀行","將軍農會","岡山農會","崁頂鄉農會","崙背鄉農會","布袋鎮農會","建華銀行","彌陀漁會","彌陀農會","彰化一信","彰化五信","彰化六信","彰化十信","彰化銀行","復華銀行","恒春農會","慶豐銀行","成功農會","斗六農會","斗南農會","新埤農會","新港漁會","新港農會","新營農會","新秀農會","新竹一信","新竹三信","新竹商銀","旗山農會","日盛銀行","朴子農會","杉林農會","東亞銀行","東河農會","東港漁會","東港鎮農會","東石農會","板信銀行","枋山農會","林園區漁會","林園農會","林邊區漁會","桃園信合社","梅山農會","梓官農會","標旗銀行","橋頭農會","歸仁農會","民雄農會","水上鄉農會","永安漁會","永安農會","永康農會","永靖農會","池上農會","淡水一信","淡水信合社","渣打銀行","湖內農會","溪口農會","滿州農會","澎湖一信","澎湖二信","澎湖區漁會","澎湖農會","燕巢農會","玉井農會","玉山銀行","琉球區漁會","琉球農會","田寮農會","甲仙農會","番路農會","秀水農會","竹南信合社","竹塘農會","竹崎農會","第一銀行","第七商銀","美濃農會","義竹農會","聯邦銀行","臺灣企銀","臺灣新光商銀","興達港漁會","花旗銀行","花蓮一信","花蓮二信","花蓮企銀","茄萣農會","荷蘭銀行","莿桐農會","華僑銀行","華南銀行","華泰銀行","萬泰銀行","虎尾農會","褒忠農會","西港農會","西螺農會","路竹農會","農業金庫","連江縣農會","運通銀行","遠東銀行","里港鄉農會","金門信合社","長濱農會","關山農會","阿蓮農會","陽信銀行","雲林漁會","首都銀行","高雄三信","高雄二信","高雄市農會","高雄銀行","鳥松農會","鳳山市農會","鹽水農會","鹿港信合社","鹿草農會","鹿野農會","麟洛農會"];
foreach ($arr as $_k => $_v){
    echo $_k. ' ' .mb_substr($_v,0,1).' : '.getFirstCharter(mb_substr($_v,0,1)) . PHP_EOL;
}


var_dump(count($arr));exit;
